Revit 2027 API
ImageView.ImageInstanceId Property
 Id of the image in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ImageInstanceId { get; }
Public ReadOnly Property ImageInstanceId As ElementId
	Get
public:
property ElementId^ ImageInstanceId {
	ElementId^ get ();
}
member ImageInstanceId : ElementId with get
Property Value
ElementId
See Also
Reference
ImageView Class
Autodesk.Revit.DB Namespace